app/views/favorites/_favorite.html.erb

    <%= link_to book_favorites_path(book), method: :book do %>
     ♡<%= book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]