app/controllers/relationships_controller.rb

INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 3], ["followed_id", 1], ["created_at", "2021-05-09 07:38:55.316310"], ["updated_at", "2021-05-09 07:38:55.316310"]]
---
  def create
    follow = current_user.active_relationships.build(followed_id: params[:user_id])
    follow.save

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]
---
  def destroy
    follow = current_user.active_relationships.find_by(followed_id: params[:user_id])
    follow.destroy